Repository: Delizald/Translate
Catalog: Localization/*/Diseases/covid-19.po
Languages: id_id

source: Page info
id_id: Info Halaman

source: 1. Learn more about proteins and SARS-CoV-2
id_id: 1. Pelajari lebih lanjut tentang protein dan SARS-CoV-2

source: 2. Our blog posts in chronological order
id_id: 2. Postingan blog kita dalam urutan kronologis

source: Learn more about proteins and SARS-CoV-2
id_id: Pelajari lebih lanjut tentang protein dan SARS-CoV-2

source: Proteins are molecular machines that perform many functions we associate with life. They sense the environment (e.g. in taste and smell), perform work (e.g. muscle contraction and breaking down food), and play structural roles (e.g. your hair). They are made of a linear chain of chemicals called amino acids that, in many cases, spontaneously “fold” into compact, functional structures. Much like any other machine, it’s how a protein’s components are arranged and move that determine the protein’s function. In this case, the components are atoms.
id_id: Protein adalah mesin molekuler yang melakukan banyak fungsi yang kita kaitkan dengan kehidupan. Mereka merasakan lingkungan (misalnya dalam rasa dan bau), melakukan pekerjaan (misalnya kontraksi otot dan merombak makanan), dan memainkan peran struktural (misalnya rambut). Mereka terbuat dari rantai linier kimia yang disebut asam amino yang, dalam banyak kasus, secara spontan “terlipat” menjadi struktur fungsional yang kompak. Sama seperti mesin lainnya, bagaimana komponen protein disusun dan digerakkan adalah yang menentukan fungsi protein. Dalam hal ini, komponen tersebut adalah atom.

source: Viruses also have proteins that they use to suppress our immune systems and reproduce themselves.
id_id: Virus juga memiliki protein yang mereka gunakan untuk menekan sistem kekebalan tubuh kita dan mereproduksi dirinya sendiri.

source: To help tackle coronavirus, we want to understand how these viral proteins work and how we can design therapeutics to stop them.
id_id: Untuk membantu mengatasi virus corona, kami ingin memahami bagaimana kerja protein virus ini dan bagaimana kami merancang terapi untuk menghentikannya.

source: There are many experimental methods for determining protein structures. While extremely powerful, they only reveal a single snapshot of a protein’s usual shape. But proteins have lots of moving parts, so we really want to see the protein in action. The structures we can’t see experimentally may be the key to discovering a new therapeutic.
id_id: Terdapat banyak metode eksperimen untuk menentukan struktur protein. Meskipun sangat kuat, mereka hanya mengungkapkan satu cuplikan dari bentuk protein yang biasa. Tetapi protein memiliki banyak bagian yang bergerak, jadi kami benar-benar ingin melihat protein bekerja. Struktur yang tidak dapat kita lihat secara eksperimental mungkin menjadi kunci untuk menemukan terapi penyembuhan baru.

source: Using football as an analogy for the experimental situation, it’s as if you could only see the players lined up for the snap (the single arrangement the players spend the most time in) and were blind to the rest of the game.
id_id: Menggunakan sepak bola sebagai analogi untuk eksperimen, ini seolah-olah Anda hanya bisa melihat para pemain berbaris untuk snap (pengaturan tunggal yang paling banyak dihabiskan pemain) dan tidak melihat sisa permainan.

source: Seeing a single structure of a protein (left) is like seeing players lined up for the snap in football. Important information, but a lot missing too. The protein structure shows a sphere for each atom (blue) and red arrows highlighting the one drug binding site in this protein.
id_id: Melihat satu struktur protein (kiri) seperti melihat pemain berbaris untuk mendapatkan snap dalam sepak bola. Informasi yang penting, tapi banyak juga yang hilang. Struktur protein menunjukkan bulatan untuk setiap atom (biru) dan panah merah yang menyoroti satu situs pengikatan obat dalam protein ini.

source: Our specialty is in using computer simulations to understand proteins’ moving parts. Watching how the atoms in a protein move relative to one another is important because it captures valuable information that is inaccessible by any other means.
id_id: Spesialisasi kami adalah menggunakan simulasi komputer untuk memahami bagian protein yang bergerak. Penting untuk mengamati bagaimana atom-atom dalam protein bergerak relatif satu sama lain karena ia menangkap informasi penting yang tidak dapat diakses dengan cara lain.

source: Taking the experimental structures as starting points, we can simulate how all the atoms in the protein move, effectively filling in the rest of the game that experiments miss.
id_id: Mengambil struktur eksperimental sebagai titik awal, kita dapat mensimulasikan bagaimana semua atom dalam protein bergerak, secara efektif mengisi sisa permainan yang terlewatkan.

source: A movie capturing how the protein shown before moves is like getting to watch the whole football game. In this case, we see a pocket form that was absent in the experimental structure.
id_id: Film yang merekam bagaimana protein bergerak adalah seperti menonton sebuah pertandingan sepak bola. Dalam hal ini, kami melihat beberapa bentuk yang tidak ada dalam struktur eksperimental.

source: Doing so can reveal new therapeutic opportunities. For example, in our recent [paper](https://www.biorxiv.org/content/10.1101/2020.02.09.940510v1.abstract), we simulated a protein from Ebola virus that is typically considered ‘undruggable’ because the snapshots from experiments don’t have obvious druggable sites. But, our simulations uncovered an alternative structure that does have a druggable site. Importantly, we then performed experiments that confirmed our computational prediction, and are now searching for drugs that bind this newly discovered binding site.
id_id: Melakukannya dapat mengungkapkan peluang terapi penyembuhan baru. Misalnya, dalam [makalah](https://www.biorxiv.org/content/10.1101/2020.02.09.940510v1.abstract) terbaru kami, kami menyimulasikan protein dari virus Ebola yang biasanya dianggap 'tidak memiliki pengobatan' karena snapshot dari eksperimen tidak memiliki *druggable sites* yang jelas. Namun, simulasi kami mengungkap struktur alternatif yang memiliki *druggable sites*. Terlebih lagi, kami kemudian melakukan eksperimen yang mengonfirmasi prediksi komputasi kami, dan kami sekarang menelusuri obat yang dapat mengikat *binding sites* yang baru ditemukan ini.

source: An experimental structure of an Ebola protein doesn’t have obvious druggable sites (no deep pockets among the atoms shown as spheres).
id_id: Struktur eksperimental protein Ebola tidak memiliki *druggable sites* yang jelas (tidak ada kantong dalam di antara atom yang ditampilkan sebagai bola).

source: Our simulations captured a motion that creates a potentially druggable site in this Ebola protein. Instead of showing spheres for each atom, this cartoon shows a ribbon tracing the linear chain of amino acids (chemicals) the protein is made of.
id_id: Simulasi kami menangkap gerakan yang menciptakan *druggable sites* yang potensial dalam protein Ebola ini. Alih-alih menunjukkan bola untuk setiap atom, kartun ini menunjukkan pita yang menelusuri rantai linier asam amino (bahan kimia) yang membuat protein ini.

source: We want to do the same thing with coronavirus.
id_id: Kami ingin melakukan hal yang sama pada virus corona.

source: Spreading the knowledge with open source and open science
id_id: Menyebarkan ilmu dengan *open source* dan *open science*

source: When we are done with our analysis we upload the data here:
id_id: Ketika kami selesai dengan analisis kami, kami mengunggah data kami di sini:

source: We also make all data publicly available, so that other people working in the field can check our analysis and anyone with new methods (e.g. the always growing machine learning data analysis) can look at them at any time: [https://osf.io/2h6p4/wiki/home/](https://osf.io/2h6p4/wiki/home/)
id_id: Kami juga membuat semua data tersedia untuk publik, sehingga orang lain yang bekerja di bidang yang sama dapat memeriksa analisis kami dan siapa pun dengan metode baru (misalnya, analisis data pembelajaran mesin yang selalu berkembang) dapat melihatnya kapan saja: [https://osf.io/2h6p4/wiki/home/](https://osf.io/2h6p4/wiki/home/)

source: and [https://osf.io/dp4cb/wiki/home/](https://osf.io/dp4cb/wiki/home/)
id_id: dan [https://osf.io/dp4cb/wiki/home/](https://osf.io/dp4cb/wiki/home/)

source: We are also collaborating with other labs and groups outside the Foldingathome Consortium to solve COVID-19 asap. Learn more about the COVID Moonshot collaboration: [Link](https://covid.postera.ai/covid) COVID Moonshot dashboard: [Link](https://fah-ws3.s3.amazonaws.com/covid-moonshot/sprints/sprint-4/2020-09-06-ugi-tBu-x3110-3v3m-2020-04-Jacobs/index.html)
id_id: Kami juga berkolaborasi dengan laboratorium dan grup lain di luar Konsorsium Foldingathome untuk menyelesaikan COVID-19 secepatnya. Pelajari lebih lanjut tentang kolaborasi COVID Moonshot: [Tautan](https://covid.postera.ai/covid) Dasbor COVID Moonshot: [Tautan](https://fah-ws3.s3.amazonaws.com/covid-moonshot/sprints/sprint-4/2020-09-06-ugi-tBu-x3110-3v3m-2020-04-Jacobs/index.html)

source: What you can do
id_id: Apa yang bisa Anda lakukan

source: 1. Donate computing power:
id_id: 1. Mendonasikan daya komputasi:

source: [Downloading Folding@home](/start-folding/) and helping us run simulations is the primary way to contribute. These calculations are enormous and every little bit helps! Each simulation you run is like buying a lottery ticket. The more tickets we buy, the better our chances of hitting the jackpot. Usually, your computer will never be idle, but we’ve had such an enthusiastic response to our COVID-19 work that you will see some intermittent downtime as we sprint to setup more simulations. Please be patient with us! There is a lot of valuable science to be done, and we’re getting it running as quickly as we can.
id_id: [Mengunduh Folding@home](/start-folding/) dan membantu kami menjalankan simulasi adalah cara utama untuk berkontribusi. Perhitungan ini sangat besar dan setiap hal kecil membantu! Setiap simulasi yang Anda jalankan seperti membeli tiket lotere. Semakin banyak tiket yang kita beli, semakin besar peluang kita untuk mendapatkan jackpot. Biasanya, komputer Anda tidak akan pernah diam, tetapi kami mendapatkan tanggapan yang sangat antusias terhadap pekerjaan COVID-19 kami sehingga Anda akan melihat beberapa waktu henti yang terputus-putus saat kami berlari untuk menyiapkan lebih banyak simulasi. Mohon tegar bersama kami! Ada banyak ilmu pengetahuan berharga untuk dilakukan, dan kami menjalankannya secepat mungkin.

source: To focus on Covid-19 research you can set the project category in your FAH client to “COVID-19”.
id_id: Untuk fokus pada penelitian Covid-19 Anda dapat mengatur kategori proyek di klien FAH Anda ke “COVID-19”.

source: 2) If you don’t have computers to contribute or are feeling particularly generous, you can also [make donations](https://gifts.wustl.edu/med/index.html?other_designation_description=Folding@Home%20(Dr%20Greg%20Bowman,%20Dept%20of%20Biochemistry)&0_d_tr1=71&sc=NG) through Washington University in St. Louis. These funds are used for a number of purposes, including:
id_id: 2) Jika Anda tidak memiliki komputer untuk berkontribusi, Anda juga dapat [memberikan donasi](https://gifts.wustl.edu/med/index.html?other_designation_description=Folding@Home%20(Dr%20Greg%20Bowman,%20Dept%20of%20Biochemistry)&0_d_tr1=71&sc=NG) melalui Washington University di St. Louis. Dana ini akan digunakan untuk beberapa tujuan, termasuk:

source: 2.1) Supporting our software engineering and server-side hardware (particularly important right now as we scale up rapidly!)
id_id: 2.1) Mendukung rekayasa perangkat lunak dan perangkat keras sisi server kami (sangat penting saat ini karena kami meningkatkan skala dengan cepat!)

source: 2.2) Buying compounds to test experimentally based on insight from our simulations.
id_id: 2.2) Membeli senyawa untuk diuji secara eksperimental berdasarkan wawasan dari simulasi kami.

source: Our posts regarding Covid-19,SARS-CoV-2
id_id: Posting kami terkait Covid-19, SARS-CoV-2

source: results
id_id: hasil
