Repository: Delizald/Translate
Catalog: Localization/*/dig-deeper.po
Languages: id_id

source: Yes. Work Units are labeled with four distinct numbers in the format: Project (Run, Clone, Generation). We just described the first three; Project is the protein under study, a Run is a simulation started from a particular conformation, and Runs contain many Clones which have different initial velocities. Although Folding@home processes many different Projects, Runs, and Clones all at the same time, Clones themselves are serial in nature. They have to be simulated from start to finish, but it would be impractical for one computer to complete one by itself. Instead, your computer is given a piece of a Clone. We identify the piece using the Generation (Gen) number. One computer will start out with Generation 0, and when it finishes another computer is given Generation 1, etc. We cannot start Gen 1 until Gen 0 finishes, and there may be hundreds of Gens. This is why the Work Units have deadlines, and why speed is so important to us.
id_id: Iya. Unit Kerja diberi label dengan empat angka berbeda dalam format: Project (Run, Clone, Generation). Kami baru saja menjelaskan tiga yang pertama; *Project* adalah protein yang diteliti, *Run* adalah simulasi yang dimulai dari konformasi tertentu, dan *Run* mengandung banyak *Clone* yang memiliki kecepatan awal berbeda. Meskipun Folding@home memproses banyak *Project*, *Run*, dan *Clone* yang berbeda pada saat yang sama, *Clone* sendiri bersifat serial. Mereka harus disimulasikan dari awal hingga akhir, tetapi tidak praktis bagi satu komputer untuk menyelesaikannya sendiri. Sebagai gantinya, komputer Anda diberi bagian dari *Clone*. Kami mengidentifikasi bagian tersebut menggunakan nomor *Generation* (Gen). Satu komputer akan mulai dengan *Generation* 0, dan ketika selesai komputer lain diberi *Generation* 1, dll. Kita tidak dapat memulai Gen 1 sampai Gen 0 selesai, dan mungkin ada ratusan Gen. Inilah mengapa Unit Kerja memiliki tenggat waktu, dan mengapa kecepatan sangat penting bagi kami.

source: Why is this approach particularly useful?
id_id: Mengapa pendekatan ini sangat berguna?

source: This approach can be powerful because not only is it very amendable to distributed computing, but the available computational resources can be used more efficiently. A protein spends most of its folding time “stuck” in an energetically-favorable position, with transitions – the processes largely of interest – taking place only rarely. Likewise, any straightforward simulation of protein folding will also waste valuable time generating data with little information content. However, using the adaptive sampling concept, the model can identify when the simulation is stuck, and then reinitialize new simulations starting from potentially more fruitful areas, avoiding the wasteful process of re-exploring areas that are already well understood.
id_id: Pendekatan ini dapat menjadi efektif karena tidak hanya sangat dapat mudah untuk komputasi terdistribusi, tetapi juga sumber daya komputasi yang tersedia dapat digunakan dengan lebih efisien. Protein menghabiskan sebagian besar waktu lipatnya "terjebak" dalam posisi yang menguntungkan secara energik, dengan transisi - proses yang sebagian besar menarik - jarang terjadi. Demikian pula, simulasi lipatan protein secara langsung juga akan membuang waktu untuk menghasilkan data dengan sedikit informasi. Namun, dengan menggunakan konsep adaptive sampling, model tersebut dapat mengidentifikasi kapan simulasi terhenti, dan kemudian memulai kembali simulasi baru dari area yang berpotensi lebih berhasil, menghindari pemborosan proses dalam mengeksplorasi kembali area yang sudah dipahami dengan baik.

source: In a recent paper, we compared MSMs to more traditional simulation methods. We compared some very long folding trajectories from the Anton supercomputer to an MSM built from the same folding data. Although our MSM “chops up” the simulation into a bunch of short trajectories, it was able to reproduce their simulations very well. Moreover, we also found that the MSM approach revealed new insights into the folding process (a new folding pathway) that was missing in ANTON’s more traditional approach.
id_id: Dalam makalah baru-baru ini, kami membandingkan MSMs dengan metode simulasi yang lebih tradisional. Kami membandingkan beberapa lintasan lipat yang sangat panjang antara superkomputer Anton dan komputer biasa dengan MSM dari data lipat yang sama. Meskipun MSM “memotong” simulasi menjadi sekumpulan lintasan pendek, ia mampu mereproduksi simulasi mereka dengan sangat baik. Selain itu, kami juga menemukan bahwa pendekatan MSM mengungkapkan wawasan baru tentang proses pelipatan (jalur pelipatan baru) yang hilang dalam pendekatan ANTON yang lebih tradisional.

source: What are some of the applications for these techniques?
id_id: Apa sajakah pengaplikasian untuk teknik ini?

source: MSMs and adaptive sampling have been used to study protein folding (1-8), functional dynamics (8-11), ligand-binding (11-14), and protein-protein interactions (15).
id_id: MSMs dan adaptive sampling telah digunakan untuk mempelajari pelipatan protein (1-8), dinamika fungsional (8-11), ligand-binding (11-14), dan interaksi protein-protein (15).

source: Who answered these questions?
id_id: Siapa yang menjawab pertanyaan ini?

source: These questions were answered primarily by TJ Lane, Gregory Bowman, Robert McGibbon, Christian Schwantes, Vijay Pande, and Bruce Borden.
id_id: Pertanyaan-pertanyaan ini dijawab terutama oleh TJ Lane, Gregory Bowman, Robert McGibbon, Christian Schwantes, Vijay Pande, dan Bruce Borden.
