Repository: Delizald/Translate
Catalog: Localization/*/dig-deeper.po
Languages: id_id

source: DIG DEEPER
id_id: GALI LEBIH DALAM

source: This section describes how Folding@home simulations work and why our methods benefit from distributed computing. The descriptions found here may be slightly technical, but aims for people who would like to learn more about how this project works and how their computer is involved.
id_id: Bagian ini menjelaskan bagaimana simulasi Folding@home bekerja dan mengapa metode kami mendapatkan keuntungan dari komputasi terdistribusi. Deskripsi di sini mungkin sedikit teknis, tetapi ditujukan untuk orang yang ingin mempelajari lebih lanjut bagaimana proyek ini bekerja dan bagaimana komputer terlibat.

source: TABLE OF CONTENTS
id_id: DAFTAR ISI

source: [Why do proteins fold?](https://foldingathome.org/dig-deeper/#why-do-proteins-fold)
id_id: [Mengapa protein melipat?](https://foldingathome.org/dig-deeper/#why-do-proteins-fold)

source: [How does Folding@home simulate protein folding?](https://foldingathome.org/dig-deeper/#how-does-foldinghome-simulate-protein-folding)
id_id: [Bagaimana Folding@home menyimulasikan pelipatan protein?](https://foldingathome.org/dig-deeper/#how-does-foldinghome-simulate-protein-folding)

source: [What are Markov State Models?](https://foldingathome.org/dig-deeper/#what-are-markov-state-models)
id_id: [Apa itu Markov State Models?](https://foldingathome.org/dig-deeper/#what-are-markov-state-models)

source: [What do MSMs look like?](https://foldingathome.org/dig-deeper/#what-do-msms-look-like)
id_id: [Seperti apa MSMs itu?](https://foldingathome.org/dig-deeper/#what-do-msms-look-like)

source: [What is adaptive sampling, and how is it related to MSMs?](https://foldingathome.org/dig-deeper/#what-is-adaptive-sampling-and-how-is-it-related-to-msms)
id_id: [Apa itu adaptive sampling, dan apa kaitannya dengan MSMs?](https://foldingathome.org/dig-deeper/#what-is-adaptive-sampling-and-how-is-it-related-to-msms)

source: [How do you build an MSM using adaptive sampling?](https://foldingathome.org/dig-deeper/#how-do-you-build-an-msm-using-adaptive-sampling)
id_id: [Bagaimana Anda membuat MSM menggunakan adaptive sampling?](https://foldingathome.org/dig-deeper/#how-do-you-build-an-msm-using-adaptive-sampling)

source: [Why is this approach particularly useful?](https://foldingathome.org/dig-deeper/#why-is-this-approach-particularly-useful)
id_id: [Mengapa pendekatan ini sangat berguna?](https://foldingathome.org/dig-deeper/#why-is-this-approach-particularly-useful)

source: [What are some of the applications for these techniques?](https://foldingathome.org/dig-deeper/#what-are-some-of-the-applications-for-these-techniques)
id_id: [Apa saja contoh pengaplikasian untuk teknik ini?](https://foldingathome.org/dig-deeper/#what-are-some-of-the-applications-for-these-techniques)

source: [Who answered these questions?](https://foldingathome.org/dig-deeper/#who-answered-these-questions)
id_id: [Siapa yang menjawab pertanyaan ini?](https://foldingathome.org/dig-deeper/#who-answered-these-questions)

source: Why do proteins fold?
id_id: Mengapa protein melipat?

source: Proteins are trying to get into their most “comfortable” position, that is, where they are at the best energy equilibrium with their environment. Some proteins contain areas that are hydrophobic (hate water), so those sections of the protein will end up away from the aqueous environment by hiding in the middle of the folded protein. There are many other factors that drive the protein, but there are several different analogies that can be used to explain the general process.
id_id: Protein berusaha untuk mendapatkan posisi yang paling "nyaman", yaitu di mana mereka berada pada kesetimbangan energi terbaik dengan lingkungannya. Beberapa protein mengandung area yang hidrofobik (benci air), sehingga bagian protein tersebut akan menjauh dari lingkungan berair dengan bersembunyi di tengah protein yang melipat. Ada banyak faktor lain yang mendorong protein, tetapi terdapat beberapa analogi berbeda yang dapat digunakan untuk menjelaskan proses umum tersebut.

source: For one, think of a huge beach ball bouncing down the side of a steep mountain. The ball will bounce many times as it descends and it will eventually stop. If you throw the beach ball down it again, there will be random variations in its path and it won’t end up at the same place. If you repeat that process many, many times, you can determine that there is a statistical pattern to the final resting points. You can also see a statistical scattering in the amount of time it takes for the ball to stop. Most of the time the ball will end up at the bottom of the mountain, but occasionally it may end up in another nearby depression and never reach the lowest possible stopping point. There is a significant statistical nature to atomic motions much like this motion of the bouncing ball down the mountain. Normal folding is like all the times that the ball ends up at the lowest point. Misfolding is like when the ball ends up somewhere else.
id_id: Pertama, bayangkan bola pantai besar yang memantul di sisi gunung yang curam. Bola akan memantul beberapa kali saat turun dan pada akhirnya akan berhenti. Jika Anda melempar bola pantai tersebut kembali, akan ada variasi acak di jalurnya dan bola tidak akan berakhir di tempat yang sama. Jika Anda mengulangi proses itu berkali-kali, Anda dapat menentukan bahwa ada pola statistik untuk titik istirahat terakhir. Anda juga dapat melihat statistik hamburan dalam jumlah waktu yang dibutuhkan bola untuk berhenti. Sebagian besar waktu bola akan berakhir di dasar gunung, tetapi kadang-kadang bisa berakhir di titik depresi terdekat lainnya dan tidak pernah mencapai titik pemberhentian terendah. Terdapat sifat statistik yang signifikan untuk gerakan atom seperti gerakan bola yang memantul menuruni gunung. Pelipatan normal seperti saat bola berakhir di titik terendah. Kesalahan lipatan (*misfolding*) adalah seperti ketika bola berakhir di tempat lain.

source: In some respects, it’s also similar to parallel-parking a car in a crowded street. At first, the car is exposed, and it usually takes several steps to properly park the car in the proper position. Sometimes it may be necessary to back out slightly and then try again. A protein does the same thing. An observer can watch a hundred similar cars being parked in that space, and they would come to understand the common ways of parking, and which methods work and which don’t.
id_id: Dalam beberapa aspek, hal ini juga serupa dengan memarkir mobil secara paralel di jalan yang ramai. Umumnya diperlukan beberapa langkah untuk memarkir mobil dengan benar di posisi yang benar. Terkadang Anda perlu untuk mundur sedikit dan kemudian mencoba kembali. Protein melakukan hal yang sama. Seorang pengamat dapat menyaksikan ratusan mobil serupa diparkir di ruang itu, dan mereka akan memahami cara umum parkir, dan metode mana yang berhasil dan mana yang tidak.

source: Like both examples, it’s important for us to know about the motion of a folding protein, although we also want to know the intermediate steps along the way. Our simulation methods construct models of both of these properties. One way that makes Folding@home different from some other distributed computing projects (Rosetta@home for example) is that we want to see how the car parks, not just the end state of seeing it parked. While that’s an important result, it doesn’t shed any light on how or why a protein sometimes misfolds. By attempting to study all of the possible paths that the bouncing ball can take down the mountain, we learn a lot about the question “How did we get here?” It also gives us the opportunity to introduce changes – such as drugs – into the process that modify the probability of misfolded results.
id_id: Seperti kedua contoh tersebut, penting bagi kami untuk mengetahui tentang gerakan pelipatan protein, meskipun kami juga ingin mengetahui langkah-langkah perantara selama prosesnya. Metode simulasi kami membangun model dari kedua properti ini. Salah satu cara yang membuat Folding@home berbeda dari beberapa proyek komputasi terdistribusi lainnya (Rosetta@home misalnya) adalah kami ingin melihat bagaimana mobil parkir, bukan hanya keadaan akhir sudah terparkir. Meskipun itu adalah hasil yang penting, namun tidak menjelaskan bagaimana atau mengapa protein terkadang salah melipat. Dengan mempelajari semua kemungkinan jalur yang dapat dilalui bola pantul untuk menuruni gunung, kita belajar banyak mengenai pertanyaan "Bagaimana kita bisa sampai di sana?" Ini juga memberi kita kesempatan untuk memperkenalkan perubahan - seperti obat-obatan - ke dalam proses yang mengubah kemungkinan hasil salah melipat.

source: How does Folding@home simulate protein folding?
id_id: Bagaimana Folding@home mensimulasikan pelipatan protein?

source: Two key aspects to our simulations are adaptive sampling and Markov State Models (MSMs). The two are used together and are very important as they allow us to run efficient simulations.
id_id: Dua aspek utama dari simulasi kami adalah adaptive sampling dan Markov State Models (MSMs). Keduanya digunakan bersama dan sangat penting karena memungkinkan kami menjalankan simulasi secara efisien.

source: What are Markov State Models?
id_id: Apa itu Markov State Models?

source: Protein folding is statistical in nature, so a protein can fold in many ways. We need a map to be able to see the bigger picture. Markov State Models (MSMs) are a way of describing all the conformations (shapes) a protein – or other biomolecule for that matter – explores as a set of states (i.e. distinct structures) and the transition rates between them. They also map out the protein’s motion and energy properties as it folds from one shape to another. Once we have all this information, we can observe the factors that influenced folding, which is especially important if the protein misfolds. Much of the theory underlying these methods is quite old but their use has been limited by the challenges inherent to identifying a reasonable set of states.
id_id: Pelipatan protein bersifat statistik, sehingga protein dapat melipat dengan banyak cara. Kami membutuhkan peta untuk dapat melihat gambaran yang lebih besar. Markov State Models (MSMs) adalah cara untuk menggambarkan semua konformasi (bentuk) protein - atau biomolekul lain - dieksplorasi sebagai satu set keadaan (yaitu struktur yang berbeda) dan tingkat transisi di antara mereka. Metode ini juga memetakan sifat gerak dan energi protein saat melipat dari satu bentuk ke bentuk lainnya. Setelah semua informasi ini didapat, kami dapat mengamati faktor-faktor yang memengaruhi pelipatan, terutama jika protein salah melipat. Banyak teori yang mendasari metode ini sudah cukup tua tetapi penggunaannya dibatasi oleh tantangan untuk mengidentifikasi suatu set keadaan yang penting.

source: MSMs are particularly useful to us as they facilitate parallelization across many computer processors by allowing for the statistical aggregation of short, independent simulation trajectories. This replaces the need for single long trajectories, and thus has been widely employed by distributed computing networks such as Folding@home and GPUGRID. Further, through adaptive sampling, MSMs provide a way to increase the efficiency of simulation without introducing artificial biases or approximations. We’ve been making a lot of progress with developing Markov state model (MSM) methods for analyzing the data we generate with the help of the FAH community. Several Pande Group members include Drs. Xuhui Huang and Gregory Bowman have developed MSMBuilder, an open-source software package used to build, analyze, and visualize MSMs. Since its release in 2009, it’s been download over 1,600 times across five continents and has been used in at least 40 publications to date.
id_id: MSMs sangat berguna bagi kami karena memfasilitasi paralelisasi di banyak prosesor komputer dengan memungkinkan agregasi statistik, lintasan simulasi secara independen. Hal ini menggantikan kebutuhan untuk lintasan panjang tunggal, dan oleh karenanya telah banyak digunakan oleh jaringan komputasi terdistribusi seperti Folding@home dan GPUGRID. Selanjutnya, melalui adaptive sampling, MSMs menyediakan jalan untuk meningkatkan efisiensi simulasi tanpa memasukkan bias atau perkiraan buatan. Kami telah membuat banyak kemajuan dengan mengembangkan metode Markov State Model (MSM) untuk menganalisis data yang kami hasilkan dengan bantuan komunitas FAH. Beberapa anggota Pande Group termasuk Drs. Xuhui Huang dan Gregory Bowman telah mengembangkan MSMBuilder, sebuah paket perangkat lunak *open-source* yang digunakan untuk membangun, menganalisis, dan memvisualisasikan MSMs. Sejak dirilis pada tahun 2009, perangkat lunak ini telah diunduh lebih dari 1.600 kali di lima benua dan telah digunakan di setidaknya 40 publikasi hingga saat ini.

source: Formally, MSMs are a specific application of discrete-space master equations parameterized from simulation. They consist of two parts: a state space partitioning X, typically chosen to divide the system into a set of metastable states; and a master equation describing kinetics on X, represented by either a transition matrix T or rate matrix. Both the state space and master equation are found from molecular simulation. The precise manner in which this is done varies widely.
id_id: Secara resmi, MSMs adalah aplikasi spesifik untuk persamaan utama ruang diskrit yang diparameterisasi dari simulasi. Terdiri dari dua bagian: keadaan ruang partisi X, biasanya dipilih untuk membagi sistem menjadi satu set keadaan metastabil; dan persamaan utama yang menjelaskan kinetik pada X, menggambarkan matriks transisi T atau matriks laju. Baik ruang keadaan dan persamaan utama ditemukan dari simulasi molekuler. Cara yang tepat untuk melakukannya sangatlah bervariasi.

source: What do MSMs look like?
id_id: Seperti apa MSMs itu?

source: Here are two examples:
id_id: Berikut dua contohnya:

source: MSM showing 14 out of 2000 macrostates for MSM for the NTL9 protein. States that are in better equilibrium are drawn larger, and more likely transitions are represented by larger arrows. Unfolded protein show in red, native state is in green. [(Voelz et al)](https://pubmed.ncbi.nlm.nih.gov/20070076/)
id_id: MSM menunjukkan 14 dari 2000 keadaan makro pada MSM untuk protein NTL9. Keadaan dalam ekuilibrium yang lebih baik digambar lebih besar, dan transisi yang lebih mungkin terjadi ditunjukkan oleh panah yang lebih besar. Protein tak terlipat ditunjukan dengan warna merah, keadaan asal dengan warna hijau. [(Voelz et al)](https://pubmed.ncbi.nlm.nih.gov/20070076/)

source: MSM for the ACBP protein, illustrating some of the primary transitions. [(Voelz et al)](https://pubs.acs.org/doi/abs/10.1021/ja302528z)
id_id: MSM untuk protein ACBP, mengilustrasikan beberapa transisi utama. [(Voelz et al)](https://pubs.acs.org/doi/abs/10.1021/ja302528z)

source: What is adaptive sampling, and how is it related to MSMs?
id_id: Apa itu adaptive sampling, dan apa kaitannya dengan MSMs?

source: When researchers are using computers to study protein conformational dynamics (how the protein changes shape as it’s folding), the conventional approach for unbiased all-atom molecular dynamics is two-step. First, they run a set of simulations, and second, after the simulations have completed, they analyze the resulting data. The adaptive sampling Markov State Model approach involves breaking this paradigm by interleaving these two steps. Instead of building the model only after the data has been collected, it is instead built on the fly as the data is being generated. A feedback loop can then be set up where the current state of the model is used to inform the progress of further simulations.
id_id: Ketika peneliti menggunakan komputer untuk mempelajari dinamika konformasi protein (bagaimana protein berubah bentuk saat melipat), pendekatan konvensional untuk dinamika molekul atom yang tak bias terdiri dari dua langkah. Pertama, mereka menjalankan serangkaian simulasi, dan kedua, setelah simulasi selesai, mereka menganalisis data yang dihasilkan. Pendekatan adaptive sampling Markov State Model melibatkan pemecahan paradigma ini dengan menyisipkan dua langkah tersebut. Sebagai ganti dari membuat model hanya setelah data dikumpulkan, kita membuat model seiring saat data sedang dibuat. Sebuah loop umpan balik kemudian dapat diatur di mana keadaan model saat ini digunakan untuk menginformasikan kemajuan simulasi berikutnya.

source: Imagine, for example, that you were exploring a maze for the first time. Although you have no map, you do have a GPS which is able to track your progress and display the parts of the maze you’ve explored. One approach is to put the GPS in your purse and walk around blindly — bumping off walls — for as long as possible. Once you’re tired, you take out the GPS and analyze the path your trajectory took; by looking at your path on the GPS you’re able to see the structure of the maze and have effectively built a map. Unfortunately, you notice that you’ve wasted a lot of time stuck in various parts of the maze. Instead, the smarter strategy is to watch the GPS as you walk around — to try to build your map of the maze incrementally. Using your map, you’re able to identify when you’re “stuck” in a certain part of the maze, and to avoid re-exploring parts of the maze that you’re confident that you’ve already discovered.
id_id: Bayangkan, misalnya, Anda menjelajahi labirin untuk pertama kalinya. Meskipun Anda tidak memiliki peta, Anda memiliki GPS yang dapat melacak kemajuan Anda dan menampilkan bagian dari labirin yang telah Anda jelajahi. Salah satu pendekatannya adalah dengan meletakkan GPS di dompet Anda dan berjalan tanpa arah - menabrak dinding - selama mungkin. Setelah Anda lelah, Anda mengambil GPS dan menganalisis lintasan yang Anda diambil; dengan melihat lintasan Anda di GPS Anda dapat melihat struktur labirin dan membuat peta secara efektif. Sayangnya, Anda sadar bahwa Anda telah membuang banyak waktu terjebak di berbagai bagian labirin. Sebagai gantinya, strategi yang lebih cerdas adalah dengan memperhatikan GPS saat Anda berjalan - mencoba membangun peta labirin secara bertahap. Dengan peta tersebut, Anda dapat mengidentifikasi saat Anda "terjebak" di bagian tertentu dari labirin, dan menghindari penjelajahan ulang bagian labirin yang Anda yakin telah temukan.

source: In many ways, these two approaches to exploring a maze are analogous to the two approaches to collecting and analyzing molecular simulations. Due to the incremental nature of building the model on the fly in the adaptive sampling approach, it is possible to increase the efficiency of simulations.
id_id: Dalam banyak hal, kedua pendekatan untuk menjelajahi labirin ini dianalogikan dengan dua pendekatan untuk mengumpulkan dan menganalisis simulasi molekuler. Karena sifat inkremental pembuatan model dengan cepat dalam pendekatan adaptive sampling, sangat dimungkinkan efisiensi simulasi dapat ditingkatkan.

source: How do you build an MSM using adaptive sampling?
id_id: Bagaimana Anda membangun MSM menggunakan adaptive sampling?

source: To start a simulation project, we first must choose some initial conformations (a protein’s shape) to begin with. The heuristic methods we use so far include running high-temperature simulations, employing Rosetta’s Monte Carlo algorithm, and shooting off related MSMs of similar proteins. Once we have a set of conformations, each of them becomes the starting point for some simulations which together we call a Run. Within each Run, we launch many trajectories, each called a Clone. Thus, all of the Clones in a Run start from the same initial protein shape, but they have a different initial velocity, i.e. the atoms are given a different initial push in one direction or another. The Clones from a Run may find additional conformations, in which case that Run ends and several more Runs are started from them. This process continues with a lot of Runs branching out to other conformations, perhaps merging back together to a common shape with other Runs. In the end, we end up with a model with tens of thousands of different conformations, (terabytes of data!) and we can see all the shapes and energy states that the protein can take on while its folding towards its “native state”, the chances of all the transitions occurring, and how long it takes the protein to complete a transition from one conformation to another. More importantly, we can identify the places where the protein misfolds and gets stuck, which then leads to more research and models on how we can prevent this from happening. The more computers we have participating, the faster we can complete the Markov State Model.
id_id: Untuk memulai proyek simulasi, pertama-tama kita harus memilih beberapa konformasi awal (bentuk protein) sebagai permulaan. Metode heuristik yang kami gunakan sejauh ini mencakup menjalankan simulasi suhu tinggi, menggunakan algoritme Monte Carlo Rosetta, dan menembak MSMs terkait dari protein serupa. Begitu kita memiliki sekumpulan konformasi, masing-masing menjadi titik awal untuk beberapa simulasi yang bersama-sama kita sebut *Run*. Dalam setiap *Run*, kami meluncurkan banyak lintasan, masing-masing disebut *Clone*. Jadi, semua *Clone* dalam sebuah *Run* dimulai dari bentuk protein awal yang sama, tetapi mereka memiliki kecepatan awal yang berbeda, yaitu atom diberi dorongan awal yang berbeda dalam satu arah atau lainnya. Klon dari *Clone* dari sebuah *Run* mungkin menemukan konformasi tambahan, dalam hal ini *Run* berakhir dan beberapa *Run* akan dimulai lagi darinya. Proses ini berlanjut dengan banyak *Run* yang bercabang ke konformasi lain, mungkin bergabung kembali menjadi bentuk yang sama dengan *Run* lainnya. Pada akhirnya, kita mendapatkan model dengan puluhan ribu konformasi berbeda, (terabyte data!) dan kita dapat melihat semua bentuk dan keadaan energi yang dapat diambil oleh protein saat melipat ke arah "keadaan asalnya", kemungkinan semua transisi terjadi, dan berapa lama protein menyelesaikan transisi dari satu konformasi ke lainnya. Lebih penting lagi, kami dapat mengidentifikasi tempat-tempat di mana protein salah melipat dan terjebak, yang kemudian mengarah pada lebih banyak penelitian dan model tentang bagaimana kami dapat mencegah hal ini terjadi. Semakin banyak komputer yang berpartisipasi, semakin cepat kami dapat menyelesaikan Markov State Model.

source: Aren’t these the PRCG numbers?
id_id: Bukankah ini angka-angka PRCG?
